---
kind: property
id: P:Autodesk.Revit.Exceptions.CentralModelContentionException.CurrentUser
source: html/0a0ef591-4f53-5e0c-ce7b-4867b85ac0bb.htm
---
# Autodesk.Revit.Exceptions.CentralModelContentionException.CurrentUser Property

Retrieves current user name.

## Syntax (C#)
```csharp
public string CurrentUser { get; }
```